{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 618, 2], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "s0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32], "dtype": "float32", "sparse": false, "name": "s0"}, "inbound_nodes": []}, {"name": "bidirectional_1", "class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_3", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 16, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "repeat_vector_1", "class_name": "RepeatVector", "config": {"name": "repeat_vector_1", "trainable": true, "n": 618}, "inbound_nodes": [[["s0", 0, 0, {}]], [["lstm_1", 0, 0, {}]], [["lstm_1", 1, 0, {}]], [["lstm_1", 2, 0, {}]], [["lstm_1", 3, 0, {}]], [["lstm_1", 4, 0, {}]], [["lstm_1", 5, 0, {}]], [["lstm_1", 6, 0, {}]], [["lstm_1", 7, 0, {}]], [["lstm_1", 8, 0, {}]], [["lstm_1", 9, 0, {}]], [["lstm_1", 10, 0, {}]], [["lstm_1", 11, 0, {}]], [["lstm_1", 12, 0, {}]], [["lstm_1", 13, 0, {}]], [["lstm_1", 14, 0, {}]], [["lstm_1", 15, 0, {}]], [["lstm_1", 16, 0, {}]], [["lstm_1", 17, 0, {}]], [["lstm_1", 18, 0, {}]], [["lstm_1", 19, 0, {}]], [["lstm_1", 20, 0, {}]], [["lstm_1", 21, 0, {}]], [["lstm_1", 22, 0, {}]], [["lstm_1", 23, 0, {}]], [["lstm_1", 24, 0, {}]], [["lstm_1", 25, 0, {}]], [["lstm_1", 26, 0, {}]], [["lstm_1", 27, 0, {}]], [["lstm_1", 28, 0, {}]], [["lstm_1", 29, 0, {}]], [["lstm_1", 30, 0, {}]], [["lstm_1", 31, 0, {}]], [["lstm_1", 32, 0, {}]], [["lstm_1", 33, 0, {}]], [["lstm_1", 34, 0, {}]], [["lstm_1", 35, 0, {}]], [["lstm_1", 36, 0, {}]], [["lstm_1", 37, 0, {}]], [["lstm_1", 38, 0, {}]], [["lstm_1", 39, 0, {}]], [["lstm_1", 40, 0, {}]], [["lstm_1", 41, 0, {}]], [["lstm_1", 42, 0, {}]], [["lstm_1", 43, 0, {}]], [["lstm_1", 44, 0, {}]], [["lstm_1", 45, 0, {}]], [["lstm_1", 46, 0, {}]], [["lstm_1", 47, 0, {}]], [["lstm_1", 48, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 0, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 1, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 2, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 3, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 4, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 5, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 6, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 7, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 8, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 9, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 10, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 11, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 12, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 13, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 14, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 15, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 16, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 17, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 18, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 19, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 20, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 21, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 22, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 23, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 24, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 25, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 26, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 27, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 28, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 29, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 30, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 31, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 32, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 33, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 34, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 35, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 36, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 37, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 38, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 39, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 40, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 41, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 42, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 43, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 44, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 45, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 46, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 47, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 48, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 49, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 10, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]], [["concatenate_1", 1, 0, {}]], [["concatenate_1", 2, 0, {}]], [["concatenate_1", 3, 0, {}]], [["concatenate_1", 4, 0, {}]], [["concatenate_1", 5, 0, {}]], [["concatenate_1", 6, 0, {}]], [["concatenate_1", 7, 0, {}]], [["concatenate_1", 8, 0, {}]], [["concatenate_1", 9, 0, {}]], [["concatenate_1", 10, 0, {}]], [["concatenate_1", 11, 0, {}]], [["concatenate_1", 12, 0, {}]], [["concatenate_1", 13, 0, {}]], [["concatenate_1", 14, 0, {}]], [["concatenate_1", 15, 0, {}]], [["concatenate_1", 16, 0, {}]], [["concatenate_1", 17, 0, {}]], [["concatenate_1", 18, 0, {}]], [["concatenate_1", 19, 0, {}]], [["concatenate_1", 20, 0, {}]], [["concatenate_1", 21, 0, {}]], [["concatenate_1", 22, 0, {}]], [["concatenate_1", 23, 0, {}]], [["concatenate_1", 24, 0, {}]], [["concatenate_1", 25, 0, {}]], [["concatenate_1", 26, 0, {}]], [["concatenate_1", 27, 0, {}]], [["concatenate_1", 28, 0, {}]], [["concatenate_1", 29, 0, {}]], [["concatenate_1", 30, 0, {}]], [["concatenate_1", 31, 0, {}]], [["concatenate_1", 32, 0, {}]], [["concatenate_1", 33, 0, {}]], [["concatenate_1", 34, 0, {}]], [["concatenate_1", 35, 0, {}]], [["concatenate_1", 36, 0, {}]], [["concatenate_1", 37, 0, {}]], [["concatenate_1", 38, 0, {}]], [["concatenate_1", 39, 0, {}]], [["concatenate_1", 40, 0, {}]], [["concatenate_1", 41, 0, {}]], [["concatenate_1", 42, 0, {}]], [["concatenate_1", 43, 0, {}]], [["concatenate_1", 44, 0, {}]], [["concatenate_1", 45, 0, {}]], [["concatenate_1", 46, 0, {}]], [["concatenate_1", 47, 0, {}]], [["concatenate_1", 48, 0, {}]], [["concatenate_1", 49, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]], [["dense_1", 1, 0, {}]], [["dense_1", 2, 0, {}]], [["dense_1", 3, 0, {}]], [["dense_1", 4, 0, {}]], [["dense_1", 5, 0, {}]], [["dense_1", 6, 0, {}]], [["dense_1", 7, 0, {}]], [["dense_1", 8, 0, {}]], [["dense_1", 9, 0, {}]], [["dense_1", 10, 0, {}]], [["dense_1", 11, 0, {}]], [["dense_1", 12, 0, {}]], [["dense_1", 13, 0, {}]], [["dense_1", 14, 0, {}]], [["dense_1", 15, 0, {}]], [["dense_1", 16, 0, {}]], [["dense_1", 17, 0, {}]], [["dense_1", 18, 0, {}]], [["dense_1", 19, 0, {}]], [["dense_1", 20, 0, {}]], [["dense_1", 21, 0, {}]], [["dense_1", 22, 0, {}]], [["dense_1", 23, 0, {}]], [["dense_1", 24, 0, {}]], [["dense_1", 25, 0, {}]], [["dense_1", 26, 0, {}]], [["dense_1", 27, 0, {}]], [["dense_1", 28, 0, {}]], [["dense_1", 29, 0, {}]], [["dense_1", 30, 0, {}]], [["dense_1", 31, 0, {}]], [["dense_1", 32, 0, {}]], [["dense_1", 33, 0, {}]], [["dense_1", 34, 0, {}]], [["dense_1", 35, 0, {}]], [["dense_1", 36, 0, {}]], [["dense_1", 37, 0, {}]], [["dense_1", 38, 0, {}]], [["dense_1", 39, 0, {}]], [["dense_1", 40, 0, {}]], [["dense_1", 41, 0, {}]], [["dense_1", 42, 0, {}]], [["dense_1", 43, 0, {}]], [["dense_1", 44, 0, {}]], [["dense_1", 45, 0, {}]], [["dense_1", 46, 0, {}]], [["dense_1", 47, 0, {}]], [["dense_1", 48, 0, {}]], [["dense_1", 49, 0, {}]]]}, {"name": "attention_weights_encoder", "class_name": "Activation", "config": {"name": "attention_weights_encoder", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["dense_2", 0, 0, {}]], [["dense_2", 1, 0, {}]], [["dense_2", 2, 0, {}]], [["dense_2", 3, 0, {}]], [["dense_2", 4, 0, {}]], [["dense_2", 5, 0, {}]], [["dense_2", 6, 0, {}]], [["dense_2", 7, 0, {}]], [["dense_2", 8, 0, {}]], [["dense_2", 9, 0, {}]], [["dense_2", 10, 0, {}]], [["dense_2", 11, 0, {}]], [["dense_2", 12, 0, {}]], [["dense_2", 13, 0, {}]], [["dense_2", 14, 0, {}]], [["dense_2", 15, 0, {}]], [["dense_2", 16, 0, {}]], [["dense_2", 17, 0, {}]], [["dense_2", 18, 0, {}]], [["dense_2", 19, 0, {}]], [["dense_2", 20, 0, {}]], [["dense_2", 21, 0, {}]], [["dense_2", 22, 0, {}]], [["dense_2", 23, 0, {}]], [["dense_2", 24, 0, {}]], [["dense_2", 25, 0, {}]], [["dense_2", 26, 0, {}]], [["dense_2", 27, 0, {}]], [["dense_2", 28, 0, {}]], [["dense_2", 29, 0, {}]], [["dense_2", 30, 0, {}]], [["dense_2", 31, 0, {}]], [["dense_2", 32, 0, {}]], [["dense_2", 33, 0, {}]], [["dense_2", 34, 0, {}]], [["dense_2", 35, 0, {}]], [["dense_2", 36, 0, {}]], [["dense_2", 37, 0, {}]], [["dense_2", 38, 0, {}]], [["dense_2", 39, 0, {}]], [["dense_2", 40, 0, {}]], [["dense_2", 41, 0, {}]], [["dense_2", 42, 0, {}]], [["dense_2", 43, 0, {}]], [["dense_2", 44, 0, {}]], [["dense_2", 45, 0, {}]], [["dense_2", 46, 0, {}]], [["dense_2", 47, 0, {}]], [["dense_2", 48, 0, {}]], [["dense_2", 49, 0, {}]]]}, {"name": "dot_1", "class_name": "Dot", "config": {"name": "dot_1", "trainable": true, "axes": 1, "normalize": false}, "inbound_nodes": [[["attention_weights_encoder", 0, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 1, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 2, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 3, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 4, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 5, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 6, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 7, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 8, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 9, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 10, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 11, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 12, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 13, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 14, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 15, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 16, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 17, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 18, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 19, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 20, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 21, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 22, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 23, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 24, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 25, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 26, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 27, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 28, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 29, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 30, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 31, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 32, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 33, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 34, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 35, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 36, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 37, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 38, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 39, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 40, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 41, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 42, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 43, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 44, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 45, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 46, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 47, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 48, 0, {}], ["bidirectional_1", 0, 0, {}]], [["attention_weights_encoder", 49, 0, {}], ["bidirectional_1", 0, 0, {}]]]}, {"name": "c0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32], "dtype": "float32", "sparse": false, "name": "c0"}, "inbound_nodes": []}, {"name": "lstm_1", "class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "return_sequences": false, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "units": 32, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["dot_1", 0, 0, {}], ["s0", 0, 0, {}], ["c0", 0, 0, {}]], [["dot_1", 1, 0, {}], ["lstm_1", 0, 0, {}], ["lstm_1", 0, 2, {}]], [["dot_1", 2, 0, {}], ["lstm_1", 1, 0, {}], ["lstm_1", 1, 2, {}]], [["dot_1", 3, 0, {}], ["lstm_1", 2, 0, {}], ["lstm_1", 2, 2, {}]], [["dot_1", 4, 0, {}], ["lstm_1", 3, 0, {}], ["lstm_1", 3, 2, {}]], [["dot_1", 5, 0, {}], ["lstm_1", 4, 0, {}], ["lstm_1", 4, 2, {}]], [["dot_1", 6, 0, {}], ["lstm_1", 5, 0, {}], ["lstm_1", 5, 2, {}]], [["dot_1", 7, 0, {}], ["lstm_1", 6, 0, {}], ["lstm_1", 6, 2, {}]], [["dot_1", 8, 0, {}], ["lstm_1", 7, 0, {}], ["lstm_1", 7, 2, {}]], [["dot_1", 9, 0, {}], ["lstm_1", 8, 0, {}], ["lstm_1", 8, 2, {}]], [["dot_1", 10, 0, {}], ["lstm_1", 9, 0, {}], ["lstm_1", 9, 2, {}]], [["dot_1", 11, 0, {}], ["lstm_1", 10, 0, {}], ["lstm_1", 10, 2, {}]], [["dot_1", 12, 0, {}], ["lstm_1", 11, 0, {}], ["lstm_1", 11, 2, {}]], [["dot_1", 13, 0, {}], ["lstm_1", 12, 0, {}], ["lstm_1", 12, 2, {}]], [["dot_1", 14, 0, {}], ["lstm_1", 13, 0, {}], ["lstm_1", 13, 2, {}]], [["dot_1", 15, 0, {}], ["lstm_1", 14, 0, {}], ["lstm_1", 14, 2, {}]], [["dot_1", 16, 0, {}], ["lstm_1", 15, 0, {}], ["lstm_1", 15, 2, {}]], [["dot_1", 17, 0, {}], ["lstm_1", 16, 0, {}], ["lstm_1", 16, 2, {}]], [["dot_1", 18, 0, {}], ["lstm_1", 17, 0, {}], ["lstm_1", 17, 2, {}]], [["dot_1", 19, 0, {}], ["lstm_1", 18, 0, {}], ["lstm_1", 18, 2, {}]], [["dot_1", 20, 0, {}], ["lstm_1", 19, 0, {}], ["lstm_1", 19, 2, {}]], [["dot_1", 21, 0, {}], ["lstm_1", 20, 0, {}], ["lstm_1", 20, 2, {}]], [["dot_1", 22, 0, {}], ["lstm_1", 21, 0, {}], ["lstm_1", 21, 2, {}]], [["dot_1", 23, 0, {}], ["lstm_1", 22, 0, {}], ["lstm_1", 22, 2, {}]], [["dot_1", 24, 0, {}], ["lstm_1", 23, 0, {}], ["lstm_1", 23, 2, {}]], [["dot_1", 25, 0, {}], ["lstm_1", 24, 0, {}], ["lstm_1", 24, 2, {}]], [["dot_1", 26, 0, {}], ["lstm_1", 25, 0, {}], ["lstm_1", 25, 2, {}]], [["dot_1", 27, 0, {}], ["lstm_1", 26, 0, {}], ["lstm_1", 26, 2, {}]], [["dot_1", 28, 0, {}], ["lstm_1", 27, 0, {}], ["lstm_1", 27, 2, {}]], [["dot_1", 29, 0, {}], ["lstm_1", 28, 0, {}], ["lstm_1", 28, 2, {}]], [["dot_1", 30, 0, {}], ["lstm_1", 29, 0, {}], ["lstm_1", 29, 2, {}]], [["dot_1", 31, 0, {}], ["lstm_1", 30, 0, {}], ["lstm_1", 30, 2, {}]], [["dot_1", 32, 0, {}], ["lstm_1", 31, 0, {}], ["lstm_1", 31, 2, {}]], [["dot_1", 33, 0, {}], ["lstm_1", 32, 0, {}], ["lstm_1", 32, 2, {}]], [["dot_1", 34, 0, {}], ["lstm_1", 33, 0, {}], ["lstm_1", 33, 2, {}]], [["dot_1", 35, 0, {}], ["lstm_1", 34, 0, {}], ["lstm_1", 34, 2, {}]], [["dot_1", 36, 0, {}], ["lstm_1", 35, 0, {}], ["lstm_1", 35, 2, {}]], [["dot_1", 37, 0, {}], ["lstm_1", 36, 0, {}], ["lstm_1", 36, 2, {}]], [["dot_1", 38, 0, {}], ["lstm_1", 37, 0, {}], ["lstm_1", 37, 2, {}]], [["dot_1", 39, 0, {}], ["lstm_1", 38, 0, {}], ["lstm_1", 38, 2, {}]], [["dot_1", 40, 0, {}], ["lstm_1", 39, 0, {}], ["lstm_1", 39, 2, {}]], [["dot_1", 41, 0, {}], ["lstm_1", 40, 0, {}], ["lstm_1", 40, 2, {}]], [["dot_1", 42, 0, {}], ["lstm_1", 41, 0, {}], ["lstm_1", 41, 2, {}]], [["dot_1", 43, 0, {}], ["lstm_1", 42, 0, {}], ["lstm_1", 42, 2, {}]], [["dot_1", 44, 0, {}], ["lstm_1", 43, 0, {}], ["lstm_1", 43, 2, {}]], [["dot_1", 45, 0, {}], ["lstm_1", 44, 0, {}], ["lstm_1", 44, 2, {}]], [["dot_1", 46, 0, {}], ["lstm_1", 45, 0, {}], ["lstm_1", 45, 2, {}]], [["dot_1", 47, 0, {}], ["lstm_1", 46, 0, {}], ["lstm_1", 46, 2, {}]], [["dot_1", 48, 0, {}], ["lstm_1", 47, 0, {}], ["lstm_1", 47, 2, {}]], [["dot_1", 49, 0, {}], ["lstm_1", 48, 0, {}], ["lstm_1", 48, 2, {}]]]}, {"name": "dense_5", "class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "units": 2, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_1", 0, 0, {}]], [["lstm_1", 1, 0, {}]], [["lstm_1", 2, 0, {}]], [["lstm_1", 3, 0, {}]], [["lstm_1", 4, 0, {}]], [["lstm_1", 5, 0, {}]], [["lstm_1", 6, 0, {}]], [["lstm_1", 7, 0, {}]], [["lstm_1", 8, 0, {}]], [["lstm_1", 9, 0, {}]], [["lstm_1", 10, 0, {}]], [["lstm_1", 11, 0, {}]], [["lstm_1", 12, 0, {}]], [["lstm_1", 13, 0, {}]], [["lstm_1", 14, 0, {}]], [["lstm_1", 15, 0, {}]], [["lstm_1", 16, 0, {}]], [["lstm_1", 17, 0, {}]], [["lstm_1", 18, 0, {}]], [["lstm_1", 19, 0, {}]], [["lstm_1", 20, 0, {}]], [["lstm_1", 21, 0, {}]], [["lstm_1", 22, 0, {}]], [["lstm_1", 23, 0, {}]], [["lstm_1", 24, 0, {}]], [["lstm_1", 25, 0, {}]], [["lstm_1", 26, 0, {}]], [["lstm_1", 27, 0, {}]], [["lstm_1", 28, 0, {}]], [["lstm_1", 29, 0, {}]], [["lstm_1", 30, 0, {}]], [["lstm_1", 31, 0, {}]], [["lstm_1", 32, 0, {}]], [["lstm_1", 33, 0, {}]], [["lstm_1", 34, 0, {}]], [["lstm_1", 35, 0, {}]], [["lstm_1", 36, 0, {}]], [["lstm_1", 37, 0, {}]], [["lstm_1", 38, 0, {}]], [["lstm_1", 39, 0, {}]], [["lstm_1", 40, 0, {}]], [["lstm_1", 41, 0, {}]], [["lstm_1", 42, 0, {}]], [["lstm_1", 43, 0, {}]], [["lstm_1", 44, 0, {}]], [["lstm_1", 45, 0, {}]], [["lstm_1", 46, 0, {}]], [["lstm_1", 47, 0, {}]], [["lstm_1", 48, 0, {}]], [["lstm_1", 49, 0, {}]]]}, {"name": "reshape_1", "class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"name": "reshape_2", "class_name": "Reshape", "config": {"name": "reshape_2", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 1, 0, {}]]]}, {"name": "reshape_3", "class_name": "Reshape", "config": {"name": "reshape_3", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 2, 0, {}]]]}, {"name": "reshape_4", "class_name": "Reshape", "config": {"name": "reshape_4", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 3, 0, {}]]]}, {"name": "reshape_5", "class_name": "Reshape", "config": {"name": "reshape_5", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 4, 0, {}]]]}, {"name": "reshape_6", "class_name": "Reshape", "config": {"name": "reshape_6", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 5, 0, {}]]]}, {"name": "reshape_7", "class_name": "Reshape", "config": {"name": "reshape_7", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 6, 0, {}]]]}, {"name": "reshape_8", "class_name": "Reshape", "config": {"name": "reshape_8", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 7, 0, {}]]]}, {"name": "reshape_9", "class_name": "Reshape", "config": {"name": "reshape_9", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 8, 0, {}]]]}, {"name": "reshape_10", "class_name": "Reshape", "config": {"name": "reshape_10", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 9, 0, {}]]]}, {"name": "reshape_11", "class_name": "Reshape", "config": {"name": "reshape_11", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 10, 0, {}]]]}, {"name": "reshape_12", "class_name": "Reshape", "config": {"name": "reshape_12", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 11, 0, {}]]]}, {"name": "reshape_13", "class_name": "Reshape", "config": {"name": "reshape_13", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 12, 0, {}]]]}, {"name": "reshape_14", "class_name": "Reshape", "config": {"name": "reshape_14", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 13, 0, {}]]]}, {"name": "reshape_15", "class_name": "Reshape", "config": {"name": "reshape_15", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 14, 0, {}]]]}, {"name": "reshape_16", "class_name": "Reshape", "config": {"name": "reshape_16", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 15, 0, {}]]]}, {"name": "reshape_17", "class_name": "Reshape", "config": {"name": "reshape_17", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 16, 0, {}]]]}, {"name": "reshape_18", "class_name": "Reshape", "config": {"name": "reshape_18", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 17, 0, {}]]]}, {"name": "reshape_19", "class_name": "Reshape", "config": {"name": "reshape_19", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 18, 0, {}]]]}, {"name": "reshape_20", "class_name": "Reshape", "config": {"name": "reshape_20", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 19, 0, {}]]]}, {"name": "reshape_21", "class_name": "Reshape", "config": {"name": "reshape_21", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 20, 0, {}]]]}, {"name": "reshape_22", "class_name": "Reshape", "config": {"name": "reshape_22", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 21, 0, {}]]]}, {"name": "reshape_23", "class_name": "Reshape", "config": {"name": "reshape_23", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 22, 0, {}]]]}, {"name": "reshape_24", "class_name": "Reshape", "config": {"name": "reshape_24", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 23, 0, {}]]]}, {"name": "reshape_25", "class_name": "Reshape", "config": {"name": "reshape_25", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 24, 0, {}]]]}, {"name": "reshape_26", "class_name": "Reshape", "config": {"name": "reshape_26", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 25, 0, {}]]]}, {"name": "reshape_27", "class_name": "Reshape", "config": {"name": "reshape_27", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 26, 0, {}]]]}, {"name": "reshape_28", "class_name": "Reshape", "config": {"name": "reshape_28", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 27, 0, {}]]]}, {"name": "reshape_29", "class_name": "Reshape", "config": {"name": "reshape_29", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 28, 0, {}]]]}, {"name": "reshape_30", "class_name": "Reshape", "config": {"name": "reshape_30", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 29, 0, {}]]]}, {"name": "reshape_31", "class_name": "Reshape", "config": {"name": "reshape_31", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 30, 0, {}]]]}, {"name": "reshape_32", "class_name": "Reshape", "config": {"name": "reshape_32", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 31, 0, {}]]]}, {"name": "reshape_33", "class_name": "Reshape", "config": {"name": "reshape_33", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 32, 0, {}]]]}, {"name": "reshape_34", "class_name": "Reshape", "config": {"name": "reshape_34", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 33, 0, {}]]]}, {"name": "reshape_35", "class_name": "Reshape", "config": {"name": "reshape_35", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 34, 0, {}]]]}, {"name": "reshape_36", "class_name": "Reshape", "config": {"name": "reshape_36", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 35, 0, {}]]]}, {"name": "reshape_37", "class_name": "Reshape", "config": {"name": "reshape_37", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 36, 0, {}]]]}, {"name": "reshape_38", "class_name": "Reshape", "config": {"name": "reshape_38", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 37, 0, {}]]]}, {"name": "reshape_39", "class_name": "Reshape", "config": {"name": "reshape_39", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 38, 0, {}]]]}, {"name": "reshape_40", "class_name": "Reshape", "config": {"name": "reshape_40", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 39, 0, {}]]]}, {"name": "reshape_41", "class_name": "Reshape", "config": {"name": "reshape_41", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 40, 0, {}]]]}, {"name": "reshape_42", "class_name": "Reshape", "config": {"name": "reshape_42", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 41, 0, {}]]]}, {"name": "reshape_43", "class_name": "Reshape", "config": {"name": "reshape_43", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 42, 0, {}]]]}, {"name": "reshape_44", "class_name": "Reshape", "config": {"name": "reshape_44", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 43, 0, {}]]]}, {"name": "reshape_45", "class_name": "Reshape", "config": {"name": "reshape_45", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 44, 0, {}]]]}, {"name": "reshape_46", "class_name": "Reshape", "config": {"name": "reshape_46", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 45, 0, {}]]]}, {"name": "reshape_47", "class_name": "Reshape", "config": {"name": "reshape_47", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 46, 0, {}]]]}, {"name": "reshape_48", "class_name": "Reshape", "config": {"name": "reshape_48", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 47, 0, {}]]]}, {"name": "reshape_49", "class_name": "Reshape", "config": {"name": "reshape_49", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 48, 0, {}]]]}, {"name": "reshape_50", "class_name": "Reshape", "config": {"name": "reshape_50", "trainable": true, "target_shape": [1, 2]}, "inbound_nodes": [[["dense_5", 49, 0, {}]]]}, {"name": "concatenate_3", "class_name": "Concatenate", "config": {"name": "concatenate_3", "trainable": true, "axis": -1}, "inbound_nodes": [[["reshape_1", 0, 0, {}], ["reshape_2", 0, 0, {}], ["reshape_3", 0, 0, {}], ["reshape_4", 0, 0, {}], ["reshape_5", 0, 0, {}], ["reshape_6", 0, 0, {}], ["reshape_7", 0, 0, {}], ["reshape_8", 0, 0, {}], ["reshape_9", 0, 0, {}], ["reshape_10", 0, 0, {}], ["reshape_11", 0, 0, {}], ["reshape_12", 0, 0, {}], ["reshape_13", 0, 0, {}], ["reshape_14", 0, 0, {}], ["reshape_15", 0, 0, {}], ["reshape_16", 0, 0, {}], ["reshape_17", 0, 0, {}], ["reshape_18", 0, 0, {}], ["reshape_19", 0, 0, {}], ["reshape_20", 0, 0, {}], ["reshape_21", 0, 0, {}], ["reshape_22", 0, 0, {}], ["reshape_23", 0, 0, {}], ["reshape_24", 0, 0, {}], ["reshape_25", 0, 0, {}], ["reshape_26", 0, 0, {}], ["reshape_27", 0, 0, {}], ["reshape_28", 0, 0, {}], ["reshape_29", 0, 0, {}], ["reshape_30", 0, 0, {}], ["reshape_31", 0, 0, {}], ["reshape_32", 0, 0, {}], ["reshape_33", 0, 0, {}], ["reshape_34", 0, 0, {}], ["reshape_35", 0, 0, {}], ["reshape_36", 0, 0, {}], ["reshape_37", 0, 0, {}], ["reshape_38", 0, 0, {}], ["reshape_39", 0, 0, {}], ["reshape_40", 0, 0, {}], ["reshape_41", 0, 0, {}], ["reshape_42", 0, 0, {}], ["reshape_43", 0, 0, {}], ["reshape_44", 0, 0, {}], ["reshape_45", 0, 0, {}], ["reshape_46", 0, 0, {}], ["reshape_47", 0, 0, {}], ["reshape_48", 0, 0, {}], ["reshape_49", 0, 0, {}], ["reshape_50", 0, 0, {}]]]}, {"name": "reshape_51", "class_name": "Reshape", "config": {"name": "reshape_51", "trainable": true, "target_shape": [50, 2]}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"name": "s0_d", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32], "dtype": "float32", "sparse": false, "name": "s0_d"}, "inbound_nodes": []}, {"name": "bidirectional_2", "class_name": "Bidirectional", "config": {"name": "bidirectional_2", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_4", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 16, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["reshape_51", 0, 0, {}]]]}, {"name": "repeat_vector_2", "class_name": "RepeatVector", "config": {"name": "repeat_vector_2", "trainable": true, "n": 50}, "inbound_nodes": [[["s0_d", 0, 0, {}]], [["lstm_2", 0, 0, {}]], [["lstm_2", 1, 0, {}]], [["lstm_2", 2, 0, {}]], [["lstm_2", 3, 0, {}]], [["lstm_2", 4, 0, {}]], [["lstm_2", 5, 0, {}]], [["lstm_2", 6, 0, {}]], [["lstm_2", 7, 0, {}]], [["lstm_2", 8, 0, {}]], [["lstm_2", 9, 0, {}]], [["lstm_2", 10, 0, {}]], [["lstm_2", 11, 0, {}]], [["lstm_2", 12, 0, {}]], [["lstm_2", 13, 0, {}]], [["lstm_2", 14, 0, {}]], [["lstm_2", 15, 0, {}]], [["lstm_2", 16, 0, {}]], [["lstm_2", 17, 0, {}]], [["lstm_2", 18, 0, {}]], [["lstm_2", 19, 0, {}]], [["lstm_2", 20, 0, {}]], [["lstm_2", 21, 0, {}]], [["lstm_2", 22, 0, {}]], [["lstm_2", 23, 0, {}]], [["lstm_2", 24, 0, {}]], [["lstm_2", 25, 0, {}]], [["lstm_2", 26, 0, {}]], [["lstm_2", 27, 0, {}]], [["lstm_2", 28, 0, {}]], [["lstm_2", 29, 0, {}]], [["lstm_2", 30, 0, {}]], [["lstm_2", 31, 0, {}]], [["lstm_2", 32, 0, {}]], [["lstm_2", 33, 0, {}]], [["lstm_2", 34, 0, {}]], [["lstm_2", 35, 0, {}]], [["lstm_2", 36, 0, {}]], [["lstm_2", 37, 0, {}]], [["lstm_2", 38, 0, {}]], [["lstm_2", 39, 0, {}]], [["lstm_2", 40, 0, {}]], [["lstm_2", 41, 0, {}]], [["lstm_2", 42, 0, {}]], [["lstm_2", 43, 0, {}]], [["lstm_2", 44, 0, {}]], [["lstm_2", 45, 0, {}]], [["lstm_2", 46, 0, {}]], [["lstm_2", 47, 0, {}]], [["lstm_2", 48, 0, {}]], [["lstm_2", 49, 0, {}]], [["lstm_2", 50, 0, {}]], [["lstm_2", 51, 0, {}]], [["lstm_2", 52, 0, {}]], [["lstm_2", 53, 0, {}]], [["lstm_2", 54, 0, {}]], [["lstm_2", 55, 0, {}]], [["lstm_2", 56, 0, {}]], [["lstm_2", 57, 0, {}]], [["lstm_2", 58, 0, {}]], [["lstm_2", 59, 0, {}]], [["lstm_2", 60, 0, {}]], [["lstm_2", 61, 0, {}]], [["lstm_2", 62, 0, {}]], [["lstm_2", 63, 0, {}]], [["lstm_2", 64, 0, {}]], [["lstm_2", 65, 0, {}]], [["lstm_2", 66, 0, {}]], [["lstm_2", 67, 0, {}]], [["lstm_2", 68, 0, {}]], [["lstm_2", 69, 0, {}]], [["lstm_2", 70, 0, {}]], [["lstm_2", 71, 0, {}]], [["lstm_2", 72, 0, {}]], [["lstm_2", 73, 0, {}]], [["lstm_2", 74, 0, {}]], [["lstm_2", 75, 0, {}]], [["lstm_2", 76, 0, {}]], [["lstm_2", 77, 0, {}]], [["lstm_2", 78, 0, {}]], [["lstm_2", 79, 0, {}]], [["lstm_2", 80, 0, {}]], [["lstm_2", 81, 0, {}]], [["lstm_2", 82, 0, {}]], [["lstm_2", 83, 0, {}]], [["lstm_2", 84, 0, {}]], [["lstm_2", 85, 0, {}]], [["lstm_2", 86, 0, {}]], [["lstm_2", 87, 0, {}]], [["lstm_2", 88, 0, {}]], [["lstm_2", 89, 0, {}]], [["lstm_2", 90, 0, {}]], [["lstm_2", 91, 0, {}]], [["lstm_2", 92, 0, {}]], [["lstm_2", 93, 0, {}]], [["lstm_2", 94, 0, {}]], [["lstm_2", 95, 0, {}]], [["lstm_2", 96, 0, {}]], [["lstm_2", 97, 0, {}]], [["lstm_2", 98, 0, {}]], [["lstm_2", 99, 0, {}]], [["lstm_2", 100, 0, {}]], [["lstm_2", 101, 0, {}]], [["lstm_2", 102, 0, {}]], [["lstm_2", 103, 0, {}]], [["lstm_2", 104, 0, {}]], [["lstm_2", 105, 0, {}]], [["lstm_2", 106, 0, {}]], [["lstm_2", 107, 0, {}]], [["lstm_2", 108, 0, {}]], [["lstm_2", 109, 0, {}]], [["lstm_2", 110, 0, {}]], [["lstm_2", 111, 0, {}]], [["lstm_2", 112, 0, {}]], [["lstm_2", 113, 0, {}]], [["lstm_2", 114, 0, {}]], [["lstm_2", 115, 0, {}]], [["lstm_2", 116, 0, {}]], [["lstm_2", 117, 0, {}]], [["lstm_2", 118, 0, {}]], [["lstm_2", 119, 0, {}]], [["lstm_2", 120, 0, {}]], [["lstm_2", 121, 0, {}]], [["lstm_2", 122, 0, {}]], [["lstm_2", 123, 0, {}]], [["lstm_2", 124, 0, {}]], [["lstm_2", 125, 0, {}]], [["lstm_2", 126, 0, {}]], [["lstm_2", 127, 0, {}]], [["lstm_2", 128, 0, {}]], [["lstm_2", 129, 0, {}]], [["lstm_2", 130, 0, {}]], [["lstm_2", 131, 0, {}]], [["lstm_2", 132, 0, {}]], [["lstm_2", 133, 0, {}]], [["lstm_2", 134, 0, {}]], [["lstm_2", 135, 0, {}]], [["lstm_2", 136, 0, {}]], [["lstm_2", 137, 0, {}]], [["lstm_2", 138, 0, {}]], [["lstm_2", 139, 0, {}]], [["lstm_2", 140, 0, {}]], [["lstm_2", 141, 0, {}]], [["lstm_2", 142, 0, {}]], [["lstm_2", 143, 0, {}]], [["lstm_2", 144, 0, {}]], [["lstm_2", 145, 0, {}]], [["lstm_2", 146, 0, {}]], [["lstm_2", 147, 0, {}]], [["lstm_2", 148, 0, {}]], [["lstm_2", 149, 0, {}]], [["lstm_2", 150, 0, {}]], [["lstm_2", 151, 0, {}]], [["lstm_2", 152, 0, {}]], [["lstm_2", 153, 0, {}]], [["lstm_2", 154, 0, {}]], [["lstm_2", 155, 0, {}]], [["lstm_2", 156, 0, {}]], [["lstm_2", 157, 0, {}]], [["lstm_2", 158, 0, {}]], [["lstm_2", 159, 0, {}]], [["lstm_2", 160, 0, {}]], [["lstm_2", 161, 0, {}]], [["lstm_2", 162, 0, {}]], [["lstm_2", 163, 0, {}]], [["lstm_2", 164, 0, {}]], [["lstm_2", 165, 0, {}]], [["lstm_2", 166, 0, {}]], [["lstm_2", 167, 0, {}]], [["lstm_2", 168, 0, {}]], [["lstm_2", 169, 0, {}]], [["lstm_2", 170, 0, {}]], [["lstm_2", 171, 0, {}]], [["lstm_2", 172, 0, {}]], [["lstm_2", 173, 0, {}]], [["lstm_2", 174, 0, {}]], [["lstm_2", 175, 0, {}]], [["lstm_2", 176, 0, {}]], [["lstm_2", 177, 0, {}]], [["lstm_2", 178, 0, {}]], [["lstm_2", 179, 0, {}]], [["lstm_2", 180, 0, {}]], [["lstm_2", 181, 0, {}]], [["lstm_2", 182, 0, {}]], [["lstm_2", 183, 0, {}]], [["lstm_2", 184, 0, {}]], [["lstm_2", 185, 0, {}]], [["lstm_2", 186, 0, {}]], [["lstm_2", 187, 0, {}]], [["lstm_2", 188, 0, {}]], [["lstm_2", 189, 0, {}]], [["lstm_2", 190, 0, {}]], [["lstm_2", 191, 0, {}]], [["lstm_2", 192, 0, {}]], [["lstm_2", 193, 0, {}]], [["lstm_2", 194, 0, {}]], [["lstm_2", 195, 0, {}]], [["lstm_2", 196, 0, {}]], [["lstm_2", 197, 0, {}]], [["lstm_2", 198, 0, {}]], [["lstm_2", 199, 0, {}]], [["lstm_2", 200, 0, {}]], [["lstm_2", 201, 0, {}]], [["lstm_2", 202, 0, {}]], [["lstm_2", 203, 0, {}]], [["lstm_2", 204, 0, {}]], [["lstm_2", 205, 0, {}]], [["lstm_2", 206, 0, {}]], [["lstm_2", 207, 0, {}]], [["lstm_2", 208, 0, {}]], [["lstm_2", 209, 0, {}]], [["lstm_2", 210, 0, {}]], [["lstm_2", 211, 0, {}]], [["lstm_2", 212, 0, {}]], [["lstm_2", 213, 0, {}]], [["lstm_2", 214, 0, {}]], [["lstm_2", 215, 0, {}]], [["lstm_2", 216, 0, {}]], [["lstm_2", 217, 0, {}]], [["lstm_2", 218, 0, {}]], [["lstm_2", 219, 0, {}]], [["lstm_2", 220, 0, {}]], [["lstm_2", 221, 0, {}]], [["lstm_2", 222, 0, {}]], [["lstm_2", 223, 0, {}]], [["lstm_2", 224, 0, {}]], [["lstm_2", 225, 0, {}]], [["lstm_2", 226, 0, {}]], [["lstm_2", 227, 0, {}]], [["lstm_2", 228, 0, {}]], [["lstm_2", 229, 0, {}]], [["lstm_2", 230, 0, {}]], [["lstm_2", 231, 0, {}]], [["lstm_2", 232, 0, {}]], [["lstm_2", 233, 0, {}]], [["lstm_2", 234, 0, {}]], [["lstm_2", 235, 0, {}]], [["lstm_2", 236, 0, {}]], [["lstm_2", 237, 0, {}]], [["lstm_2", 238, 0, {}]], [["lstm_2", 239, 0, {}]], [["lstm_2", 240, 0, {}]], [["lstm_2", 241, 0, {}]], [["lstm_2", 242, 0, {}]], [["lstm_2", 243, 0, {}]], [["lstm_2", 244, 0, {}]], [["lstm_2", 245, 0, {}]], [["lstm_2", 246, 0, {}]], [["lstm_2", 247, 0, {}]], [["lstm_2", 248, 0, {}]], [["lstm_2", 249, 0, {}]], [["lstm_2", 250, 0, {}]], [["lstm_2", 251, 0, {}]], [["lstm_2", 252, 0, {}]], [["lstm_2", 253, 0, {}]], [["lstm_2", 254, 0, {}]], [["lstm_2", 255, 0, {}]], [["lstm_2", 256, 0, {}]], [["lstm_2", 257, 0, {}]], [["lstm_2", 258, 0, {}]], [["lstm_2", 259, 0, {}]], [["lstm_2", 260, 0, {}]], [["lstm_2", 261, 0, {}]], [["lstm_2", 262, 0, {}]], [["lstm_2", 263, 0, {}]], [["lstm_2", 264, 0, {}]], [["lstm_2", 265, 0, {}]], [["lstm_2", 266, 0, {}]], [["lstm_2", 267, 0, {}]], [["lstm_2", 268, 0, {}]], [["lstm_2", 269, 0, {}]], [["lstm_2", 270, 0, {}]], [["lstm_2", 271, 0, {}]], [["lstm_2", 272, 0, {}]], [["lstm_2", 273, 0, {}]], [["lstm_2", 274, 0, {}]], [["lstm_2", 275, 0, {}]], [["lstm_2", 276, 0, {}]], [["lstm_2", 277, 0, {}]], [["lstm_2", 278, 0, {}]], [["lstm_2", 279, 0, {}]], [["lstm_2", 280, 0, {}]], [["lstm_2", 281, 0, {}]], [["lstm_2", 282, 0, {}]], [["lstm_2", 283, 0, {}]], [["lstm_2", 284, 0, {}]], [["lstm_2", 285, 0, {}]], [["lstm_2", 286, 0, {}]], [["lstm_2", 287, 0, {}]], [["lstm_2", 288, 0, {}]], [["lstm_2", 289, 0, {}]], [["lstm_2", 290, 0, {}]], [["lstm_2", 291, 0, {}]], [["lstm_2", 292, 0, {}]], [["lstm_2", 293, 0, {}]], [["lstm_2", 294, 0, {}]], [["lstm_2", 295, 0, {}]], [["lstm_2", 296, 0, {}]], [["lstm_2", 297, 0, {}]], [["lstm_2", 298, 0, {}]], [["lstm_2", 299, 0, {}]], [["lstm_2", 300, 0, {}]], [["lstm_2", 301, 0, {}]], [["lstm_2", 302, 0, {}]], [["lstm_2", 303, 0, {}]], [["lstm_2", 304, 0, {}]], [["lstm_2", 305, 0, {}]], [["lstm_2", 306, 0, {}]], [["lstm_2", 307, 0, {}]], [["lstm_2", 308, 0, {}]], [["lstm_2", 309, 0, {}]], [["lstm_2", 310, 0, {}]], [["lstm_2", 311, 0, {}]], [["lstm_2", 312, 0, {}]], [["lstm_2", 313, 0, {}]], [["lstm_2", 314, 0, {}]], [["lstm_2", 315, 0, {}]], [["lstm_2", 316, 0, {}]], [["lstm_2", 317, 0, {}]], [["lstm_2", 318, 0, {}]], [["lstm_2", 319, 0, {}]], [["lstm_2", 320, 0, {}]], [["lstm_2", 321, 0, {}]], [["lstm_2", 322, 0, {}]], [["lstm_2", 323, 0, {}]], [["lstm_2", 324, 0, {}]], [["lstm_2", 325, 0, {}]], [["lstm_2", 326, 0, {}]], [["lstm_2", 327, 0, {}]], [["lstm_2", 328, 0, {}]], [["lstm_2", 329, 0, {}]], [["lstm_2", 330, 0, {}]], [["lstm_2", 331, 0, {}]], [["lstm_2", 332, 0, {}]], [["lstm_2", 333, 0, {}]], [["lstm_2", 334, 0, {}]], [["lstm_2", 335, 0, {}]], [["lstm_2", 336, 0, {}]], [["lstm_2", 337, 0, {}]], [["lstm_2", 338, 0, {}]], [["lstm_2", 339, 0, {}]], [["lstm_2", 340, 0, {}]], [["lstm_2", 341, 0, {}]], [["lstm_2", 342, 0, {}]], [["lstm_2", 343, 0, {}]], [["lstm_2", 344, 0, {}]], [["lstm_2", 345, 0, {}]], [["lstm_2", 346, 0, {}]], [["lstm_2", 347, 0, {}]], [["lstm_2", 348, 0, {}]], [["lstm_2", 349, 0, {}]], [["lstm_2", 350, 0, {}]], [["lstm_2", 351, 0, {}]], [["lstm_2", 352, 0, {}]], [["lstm_2", 353, 0, {}]], [["lstm_2", 354, 0, {}]], [["lstm_2", 355, 0, {}]], [["lstm_2", 356, 0, {}]], [["lstm_2", 357, 0, {}]], [["lstm_2", 358, 0, {}]], [["lstm_2", 359, 0, {}]], [["lstm_2", 360, 0, {}]], [["lstm_2", 361, 0, {}]], [["lstm_2", 362, 0, {}]], [["lstm_2", 363, 0, {}]], [["lstm_2", 364, 0, {}]], [["lstm_2", 365, 0, {}]], [["lstm_2", 366, 0, {}]], [["lstm_2", 367, 0, {}]], [["lstm_2", 368, 0, {}]], [["lstm_2", 369, 0, {}]], [["lstm_2", 370, 0, {}]], [["lstm_2", 371, 0, {}]], [["lstm_2", 372, 0, {}]], [["lstm_2", 373, 0, {}]], [["lstm_2", 374, 0, {}]], [["lstm_2", 375, 0, {}]], [["lstm_2", 376, 0, {}]], [["lstm_2", 377, 0, {}]], [["lstm_2", 378, 0, {}]], [["lstm_2", 379, 0, {}]], [["lstm_2", 380, 0, {}]], [["lstm_2", 381, 0, {}]], [["lstm_2", 382, 0, {}]], [["lstm_2", 383, 0, {}]], [["lstm_2", 384, 0, {}]], [["lstm_2", 385, 0, {}]], [["lstm_2", 386, 0, {}]], [["lstm_2", 387, 0, {}]], [["lstm_2", 388, 0, {}]], [["lstm_2", 389, 0, {}]], [["lstm_2", 390, 0, {}]], [["lstm_2", 391, 0, {}]], [["lstm_2", 392, 0, {}]], [["lstm_2", 393, 0, {}]], [["lstm_2", 394, 0, {}]], [["lstm_2", 395, 0, {}]], [["lstm_2", 396, 0, {}]], [["lstm_2", 397, 0, {}]], [["lstm_2", 398, 0, {}]], [["lstm_2", 399, 0, {}]], [["lstm_2", 400, 0, {}]], [["lstm_2", 401, 0, {}]], [["lstm_2", 402, 0, {}]], [["lstm_2", 403, 0, {}]], [["lstm_2", 404, 0, {}]], [["lstm_2", 405, 0, {}]], [["lstm_2", 406, 0, {}]], [["lstm_2", 407, 0, {}]], [["lstm_2", 408, 0, {}]], [["lstm_2", 409, 0, {}]], [["lstm_2", 410, 0, {}]], [["lstm_2", 411, 0, {}]], [["lstm_2", 412, 0, {}]], [["lstm_2", 413, 0, {}]], [["lstm_2", 414, 0, {}]], [["lstm_2", 415, 0, {}]], [["lstm_2", 416, 0, {}]], [["lstm_2", 417, 0, {}]], [["lstm_2", 418, 0, {}]], [["lstm_2", 419, 0, {}]], [["lstm_2", 420, 0, {}]], [["lstm_2", 421, 0, {}]], [["lstm_2", 422, 0, {}]], [["lstm_2", 423, 0, {}]], [["lstm_2", 424, 0, {}]], [["lstm_2", 425, 0, {}]], [["lstm_2", 426, 0, {}]], [["lstm_2", 427, 0, {}]], [["lstm_2", 428, 0, {}]], [["lstm_2", 429, 0, {}]], [["lstm_2", 430, 0, {}]], [["lstm_2", 431, 0, {}]], [["lstm_2", 432, 0, {}]], [["lstm_2", 433, 0, {}]], [["lstm_2", 434, 0, {}]], [["lstm_2", 435, 0, {}]], [["lstm_2", 436, 0, {}]], [["lstm_2", 437, 0, {}]], [["lstm_2", 438, 0, {}]], [["lstm_2", 439, 0, {}]], [["lstm_2", 440, 0, {}]], [["lstm_2", 441, 0, {}]], [["lstm_2", 442, 0, {}]], [["lstm_2", 443, 0, {}]], [["lstm_2", 444, 0, {}]], [["lstm_2", 445, 0, {}]], [["lstm_2", 446, 0, {}]], [["lstm_2", 447, 0, {}]], [["lstm_2", 448, 0, {}]], [["lstm_2", 449, 0, {}]], [["lstm_2", 450, 0, {}]], [["lstm_2", 451, 0, {}]], [["lstm_2", 452, 0, {}]], [["lstm_2", 453, 0, {}]], [["lstm_2", 454, 0, {}]], [["lstm_2", 455, 0, {}]], [["lstm_2", 456, 0, {}]], [["lstm_2", 457, 0, {}]], [["lstm_2", 458, 0, {}]], [["lstm_2", 459, 0, {}]], [["lstm_2", 460, 0, {}]], [["lstm_2", 461, 0, {}]], [["lstm_2", 462, 0, {}]], [["lstm_2", 463, 0, {}]], [["lstm_2", 464, 0, {}]], [["lstm_2", 465, 0, {}]], [["lstm_2", 466, 0, {}]], [["lstm_2", 467, 0, {}]], [["lstm_2", 468, 0, {}]], [["lstm_2", 469, 0, {}]], [["lstm_2", 470, 0, {}]], [["lstm_2", 471, 0, {}]], [["lstm_2", 472, 0, {}]], [["lstm_2", 473, 0, {}]], [["lstm_2", 474, 0, {}]], [["lstm_2", 475, 0, {}]], [["lstm_2", 476, 0, {}]], [["lstm_2", 477, 0, {}]], [["lstm_2", 478, 0, {}]], [["lstm_2", 479, 0, {}]], [["lstm_2", 480, 0, {}]], [["lstm_2", 481, 0, {}]], [["lstm_2", 482, 0, {}]], [["lstm_2", 483, 0, {}]], [["lstm_2", 484, 0, {}]], [["lstm_2", 485, 0, {}]], [["lstm_2", 486, 0, {}]], [["lstm_2", 487, 0, {}]], [["lstm_2", 488, 0, {}]], [["lstm_2", 489, 0, {}]], [["lstm_2", 490, 0, {}]], [["lstm_2", 491, 0, {}]], [["lstm_2", 492, 0, {}]], [["lstm_2", 493, 0, {}]], [["lstm_2", 494, 0, {}]], [["lstm_2", 495, 0, {}]], [["lstm_2", 496, 0, {}]], [["lstm_2", 497, 0, {}]], [["lstm_2", 498, 0, {}]], [["lstm_2", 499, 0, {}]], [["lstm_2", 500, 0, {}]], [["lstm_2", 501, 0, {}]], [["lstm_2", 502, 0, {}]], [["lstm_2", 503, 0, {}]], [["lstm_2", 504, 0, {}]], [["lstm_2", 505, 0, {}]], [["lstm_2", 506, 0, {}]], [["lstm_2", 507, 0, {}]], [["lstm_2", 508, 0, {}]], [["lstm_2", 509, 0, {}]], [["lstm_2", 510, 0, {}]], [["lstm_2", 511, 0, {}]], [["lstm_2", 512, 0, {}]], [["lstm_2", 513, 0, {}]], [["lstm_2", 514, 0, {}]], [["lstm_2", 515, 0, {}]], [["lstm_2", 516, 0, {}]], [["lstm_2", 517, 0, {}]], [["lstm_2", 518, 0, {}]], [["lstm_2", 519, 0, {}]], [["lstm_2", 520, 0, {}]], [["lstm_2", 521, 0, {}]], [["lstm_2", 522, 0, {}]], [["lstm_2", 523, 0, {}]], [["lstm_2", 524, 0, {}]], [["lstm_2", 525, 0, {}]], [["lstm_2", 526, 0, {}]], [["lstm_2", 527, 0, {}]], [["lstm_2", 528, 0, {}]], [["lstm_2", 529, 0, {}]], [["lstm_2", 530, 0, {}]], [["lstm_2", 531, 0, {}]], [["lstm_2", 532, 0, {}]], [["lstm_2", 533, 0, {}]], [["lstm_2", 534, 0, {}]], [["lstm_2", 535, 0, {}]], [["lstm_2", 536, 0, {}]], [["lstm_2", 537, 0, {}]], [["lstm_2", 538, 0, {}]], [["lstm_2", 539, 0, {}]], [["lstm_2", 540, 0, {}]], [["lstm_2", 541, 0, {}]], [["lstm_2", 542, 0, {}]], [["lstm_2", 543, 0, {}]], [["lstm_2", 544, 0, {}]], [["lstm_2", 545, 0, {}]], [["lstm_2", 546, 0, {}]], [["lstm_2", 547, 0, {}]], [["lstm_2", 548, 0, {}]], [["lstm_2", 549, 0, {}]], [["lstm_2", 550, 0, {}]], [["lstm_2", 551, 0, {}]], [["lstm_2", 552, 0, {}]], [["lstm_2", 553, 0, {}]], [["lstm_2", 554, 0, {}]], [["lstm_2", 555, 0, {}]], [["lstm_2", 556, 0, {}]], [["lstm_2", 557, 0, {}]], [["lstm_2", 558, 0, {}]], [["lstm_2", 559, 0, {}]], [["lstm_2", 560, 0, {}]], [["lstm_2", 561, 0, {}]], [["lstm_2", 562, 0, {}]], [["lstm_2", 563, 0, {}]], [["lstm_2", 564, 0, {}]], [["lstm_2", 565, 0, {}]], [["lstm_2", 566, 0, {}]], [["lstm_2", 567, 0, {}]], [["lstm_2", 568, 0, {}]], [["lstm_2", 569, 0, {}]], [["lstm_2", 570, 0, {}]], [["lstm_2", 571, 0, {}]], [["lstm_2", 572, 0, {}]], [["lstm_2", 573, 0, {}]], [["lstm_2", 574, 0, {}]], [["lstm_2", 575, 0, {}]], [["lstm_2", 576, 0, {}]], [["lstm_2", 577, 0, {}]], [["lstm_2", 578, 0, {}]], [["lstm_2", 579, 0, {}]], [["lstm_2", 580, 0, {}]], [["lstm_2", 581, 0, {}]], [["lstm_2", 582, 0, {}]], [["lstm_2", 583, 0, {}]], [["lstm_2", 584, 0, {}]], [["lstm_2", 585, 0, {}]], [["lstm_2", 586, 0, {}]], [["lstm_2", 587, 0, {}]], [["lstm_2", 588, 0, {}]], [["lstm_2", 589, 0, {}]], [["lstm_2", 590, 0, {}]], [["lstm_2", 591, 0, {}]], [["lstm_2", 592, 0, {}]], [["lstm_2", 593, 0, {}]], [["lstm_2", 594, 0, {}]], [["lstm_2", 595, 0, {}]], [["lstm_2", 596, 0, {}]], [["lstm_2", 597, 0, {}]], [["lstm_2", 598, 0, {}]], [["lstm_2", 599, 0, {}]], [["lstm_2", 600, 0, {}]], [["lstm_2", 601, 0, {}]], [["lstm_2", 602, 0, {}]], [["lstm_2", 603, 0, {}]], [["lstm_2", 604, 0, {}]], [["lstm_2", 605, 0, {}]], [["lstm_2", 606, 0, {}]], [["lstm_2", 607, 0, {}]], [["lstm_2", 608, 0, {}]], [["lstm_2", 609, 0, {}]], [["lstm_2", 610, 0, {}]], [["lstm_2", 611, 0, {}]], [["lstm_2", 612, 0, {}]], [["lstm_2", 613, 0, {}]], [["lstm_2", 614, 0, {}]], [["lstm_2", 615, 0, {}]], [["lstm_2", 616, 0, {}]]]}, {"name": "concatenate_2", "class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "axis": -1}, "inbound_nodes": [[["bidirectional_2", 0, 0, {}], ["repeat_vector_2", 0, 0, {}]], [["bidirectional_2", 0, 0, {}], ["repeat_vector_2", 1, 0, {}]], [["bidirectional_2", 0, 0, {}], ["repeat_vector_2", 2, 0, {}]], [["bidirectional_2", 0, 0, {}], ["repeat_vector_2", 3, 0, {}]], [["bidirectional_2", 0, 0, {}], ["repeat_vector_2", 4, 0, {}]], [["bidirectional_2", 0, 0, {}], ["repeat_vector_2", 5, 0, {}]], [["bidirectional_2", 0, 0, {}], ["repeat_vector_2", 6, 0, {}]], [["bidirectional_2", 0, 0, {}], ["repeat_vector_2", 7, 0, {}]], [["bidirectional_2", 0, 0, {}], ["repeat_vector_2", 8, 0, {}]], [["bidirectional_2", 0, 0, {}], ["repeat_vector_2", 9, 0, {}]], [["bidirectional_2", 0, 0, {}], ["repeat_vector_2", 10, 0, 